count_of_hour = 1.5
count_of_home_work = 12
name_of_course = "Python"
print (f"Курс: {name_of_course}, "
       f"всего задач:{count_of_home_work}, "
       f"затрачено часов: {count_of_hour}, "
       f"среднее время выполнения {count_of_hour/count_of_home_work} часа")

"""
Роман, добрый день. Интересует стилистика и применение f-строк.
Код с принтом смотрится наглядно, но возможно существуют более красивые варианты.
Привычку написания красивого кода лучше вырабатывать сразу

Замечания принимаются

Очень понравилось как PyChar после нажатия Enter-а сам подобалял f и кавычки в каждой новой строке.
"""
